var data = {
  '0': [
    '單筆滿NT6,000(含)以上',
    '享6%現金回饋，累計上限NT$600',
    '限量3000名',
  ],
  '1': [
    '累積消費每滿NT$666',
    '「累積旅遊消費全額刷卡金回饋」抽獎機會乙次',
    '最高回饋刷卡金NT$66,666，共十名',
  ],
}

b.forEach(item => {
  console.log(item);
});

var dataBox = {
  刷卡滿額禮: {
    '0': [
      '單筆滿NT6,000(含)以上',
      '享6%現金回饋，累計上限NT$600',
      '限量3000名',
    ],
    '1': [
      '累積消費每滿NT$666',
      '「累積旅遊消費全額刷卡金回饋」抽獎機會乙次',
      '最高回饋刷卡金NT$66,666，共十名',
    ],
  },
  詳細說明: {
    詳細說明: [
      '紅利折抵與分期付款消費不得同時使用。',
      '兆豐銀行之政府網路採購卡、商務卡、附卡及VISA金融卡不適用紅利折抵活動。',
      '兆豐銀行保留此次活動交易核准與否之權利。',
      '折抵金額及點數均由系統直接換算，無法人工指定折抵某特定點數或金額。',
      '以上活動辦法，以兆豐銀行網站公告為主；兆豐銀行保留變更、修改終止之權利。',
      '各商店之紅利點數折抵金額比例與折抵上限，依各商店端公告為主。',
    ],
    注意事項: [
      '可折抵消費金額的最高比例，依銀行規定最高折抵上限為50%，則消費800元最高可用點數折抵400元',
      '為每筆刷卡的最低金額，須單一商品達最低消費金額，例：銀行規定消費限制為1,000元，則須單一次刷卡金額需達1,000元(含)以上，始能使用紅利折抵',
      '持卡人最少需要的持有的點數，超過此限制點數方可進行銀行紅利折抵。',
      '銀行信用卡紅利點數折抵現金的比例及折抵單位，如1,000點：70元，即每1,000點紅利點數可折抵70元',
      '紅利折抵活動不得與分期專案合併使用。',
      '各紅利折抵詳細辦法依各銀行公告為準。',
      '紅利點數折抵金額及點數均由系統以最高折抵上限及卡友持有最高點數換算，故無法指定折抵某特定點數或金額。',
      '系統將依您信用卡的所有點數進行折抵，點數不足最高折抵上限時，將自動取消交易，請選擇其他付款方式。',
    ],
  },
  活動詳情: 'https://www.settour.com.tw/info/card/rakutenbk/',
  id: 'mega',
  分期: '適用 3 期  6 期 無息分期',
  name: '兆豐銀行',
  卡友優惠專案: {
    '0': [
      '刷兆豐卡遊台灣主題一日遊 揪四人現省800元',
      'https://www.settour.com.tw/info/card/megabank/index1.html',
    ],
  },
  icon: 'public/img/bank-logo/bank-logo-mega.png',
  活動時間: {
    注意事項:
      '優惠1須於活動期間內至本行網站完成登錄，優惠２抽獎次數正附卡合併每戶僅有乙次中獎機會(限回饋乙次)。',
    活動時間: '2020/06/01-2020/08/31',
    領取方式: '需登錄，銀行回饋。',
  },
  紅利折扣: '1000點折抵 60 元  最高折抵上限 10%',
};
